inst/doc-software/overview.org
#+TITLE: Overview of the package BuyseTest
#+Author: Brice Ozenne
#+BEGIN_SRC R :exports none :results output :session *R* :cache no
options(width = 94)
#+END_SRC

#+RESULTS:

This vignette describes the main functionalities of the *BuyseTest*
package. This package implements the Generalized Pairwise Comparisons
(GPC) as defined in cite:buyse2010generalized for complete
observations, and extended in cite:peron2018extension to deal with
right-censoring. When considering a single endpoint, the GPC procedure
can be summarized as follow. Denote the endpoint by \(Y\) in the
treatment group and by \(X\) in the control group. Given a
threshold of clinical relevance \(\tau\), the aim of GPC is to
estimate the proportion in favor of treatment \(\Prob[Y \geq X +
\tau]\) and the proportion in favor of control \(\Prob[X \geq Y +
\tau]\). Other statistics such as the net benefit \(\Prob[Y \geq X +
\tau]-\Prob[X \geq Y + \tau]\) or the win ratio \(\frac{\Prob[Y \geq
X + \tau]}{\Prob[X \geq Y + \tau]}\) can then be deduced. It is
assumed that the reader is familar with the GPC terminology [fn::if
not, cite:buyse2010generalized is a good place to start.],
e.g. prioritized endpoints, pair, net benefit, win ratio, threshold of
clinical relevance, \ldots, since this vignette focuses on the
software aspect of the *BuyseTest* package (not on the underlying
statistical model).

\bigskip

The *BuyseTest* package contains three main functions:
- the function =BuyseTest= is the main function of the package. It
  performs the GPC, estimates the net benefit/win ratio, and output a
  /BuyseRes/ object. The user can interact with /BuyseRes/ objects using:
    + =summary= to obtain a nice display of the results
    + =coef= to extract the estimates.
    + =confint= to extract estimates, confidence intervals, and p.values.
    + =getIid= to extract the iid decomposition of the estimator.
    + =getPairScore= to extract the contribution of each pair to the net benefit/win ratio.
    + =getSurvival= to extract the estimates of the survival (only relevant for right-censored endpoints).
- the =powerBuyseTest= function performs simulation studies,
  e.g. to estimate the statistical power or assess the bias / type 1
  error rate of a test for a specific design.
- the =BuyseTest.options= function enables the user to display the
  default values used in the *BuyseTest* package (essentially used by
  the =BuyseTest= function). function. The function can also change
  the default values to better match the user needs.

\clearpage

Before going further we need to load the *BuyseTest* package in the R
session:
#+BEGIN_SRC R  :results silent   :exports code  :session *R* :cache no
library(BuyseTest)
library(data.table)
#+END_SRC

To illustrate the functionalities of the package, we will used the
=veteran= dataset from the *survival* package:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
data(veteran,package="survival")
head(veteran)
#+END_SRC

#+RESULTS:
:   trt celltype time status karno diagtime age prior
: 1   1 squamous   72      1    60        7  69     0
: 2   1 squamous  411      1    70        5  64    10
: 3   1 squamous  228      1    60        3  38     0
: 4   1 squamous  126      1    60        9  63    10
: 5   1 squamous  118      1    70       11  65    10
: 6   1 squamous   10      1    20        5  49     0

See =?veteran= for a presentation of the database.

\bigskip

_Note:_ the *BuyseTest* package is under active development. Newer
package versions may include additional functionalities and fix
previous bugs. The version of the package that is being is:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
utils::packageVersion("BuyseTest")
#+END_SRC

#+RESULTS:
: [1] '2.1.5'

For completness, the details of the R session used to generate this
document are:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 3.5.1 (2018-07-02)
Platform: x86_64-w64-mingw32/x64 (64-bit)
Running under: Windows 7 x64 (build 7601) Service Pack 1

Matrix products: default

locale:
[1] LC_COLLATE=Danish_Denmark.1252  LC_CTYPE=Danish_Denmark.1252   
[3] LC_MONETARY=Danish_Denmark.1252 LC_NUMERIC=C                   
[5] LC_TIME=Danish_Denmark.1252    

attached base packages:
[1] tools     stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] BuyseTest_2.1.5   spelling_1.2      butils.base_1.2   Rcpp_1.0.4.6      data.table_1.12.8
[6] usethis_1.4.0     devtools_2.0.1    roxygen2_7.1.0   

loaded via a namespace (and not attached):
 [1] compiler_3.5.1            iterators_1.0.12          prettyunits_1.0.2        
 [4] base64enc_0.1-3           remotes_2.0.2             testthat_2.0.0           
 [7] digest_0.6.17             pkgbuild_1.0.2            pkgload_1.0.2            
[10] lattice_0.20-35           memoise_1.1.0             rlang_0.3.1              
[13] Matrix_1.2-14             foreach_1.5.0             cli_1.0.1                
[16] parallel_3.5.1            prodlim_2019.11.13        RcppArmadillo_0.9.850.1.0
[19] withr_2.1.2               stringr_1.3.1             xml2_1.2.0               
[22] knitr_1.20                desc_1.2.0                fs_1.2.6                 
[25] stats4_3.5.1              grid_3.5.1                rprojroot_1.3-2          
[28] glue_1.3.0                R6_2.3.0                  processx_3.2.0           
[31] survival_2.44-1.1         sessioninfo_1.1.1         lava_1.6.7               
[34] callr_3.0.0               purrr_0.3.4               magrittr_1.5             
[37] splines_3.5.1             codetools_0.2-15          backports_1.1.5          
[40] ps_1.1.0                  assertthat_0.2.1          stringi_1.2.4            
[43] doParallel_1.0.15         crayon_1.3.4
#+end_example

\clearpage

