inst/doc-software/overview.tex
% Created 2020-05-27 on 15:25
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}

%%%% settings when exporting code %%%% 

\usepackage{listings}
\lstset{
backgroundcolor=\color{white},
basewidth={0.5em,0.4em},
basicstyle=\ttfamily\small,
breakatwhitespace=false,
breaklines=true,
columns=fullflexible,
commentstyle=\color[rgb]{0.5,0,0.5},
frame=single,
keepspaces=true,
keywordstyle=\color{black},
literate={~}{$\sim$}{1},
numbers=left,
numbersep=10pt,
numberstyle=\ttfamily\tiny\color{gray},
showspaces=false,
showstringspaces=false,
stepnumber=1,
stringstyle=\color[rgb]{0,.5,0},
tabsize=4,
xleftmargin=.23in,
emph={anova,apply,class,coef,colnames,colNames,colSums,dim,dcast,for,ggplot,head,if,ifelse,is.na,lapply,list.files,library,logLik,melt,plot,require,rowSums,sapply,setcolorder,setkey,str,summary,tapply},
emphstyle=\color{blue}
}

%%%% packages %%%%%

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{lmodern}
\usepackage{textcomp}
\usepackage{color}
\usepackage{enumerate}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{longtable}
\usepackage{multirow}
\usepackage{multicol}
\usepackage{changes}
\usepackage{pdflscape}
\usepackage{geometry}
\usepackage[normalem]{ulem}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{dsfont}
\usepackage{array}
\usepackage{ifthen}
\usepackage{hyperref}
\usepackage{natbib}
\RequirePackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}
\geometry{a4paper, left=10mm, right=10mm}
\RequirePackage{colortbl} % arrayrulecolor to mix colors
\RequirePackage{setspace} % to modify the space between lines - incompatible with footnote in beamer
\usepackage{authblk} % enable several affiliations (clash with beamer)
\renewcommand{\baselinestretch}{1.1}
\geometry{top=1cm}
\usepackage{enumitem}
\RequirePackage{xspace} %
\newcommand\Rlogo{\textbf{\textsf{R}}\xspace} %
\newcommand\Prob{\mathbb{P}}
\RequirePackage{epstopdf} % to be able to convert .eps to .pdf image files
\author{Brice Ozenne}
\date{\today}
\title{Overview of the package BuyseTest}
\hypersetup{
 colorlinks=true,
 citecolor=[rgb]{0,0.5,0},
 urlcolor=[rgb]{0,0,0.5},
 linkcolor=[rgb]{0,0,0.5},
 pdfauthor={Brice Ozenne},
 pdftitle={Overview of the package BuyseTest},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.4)},
 pdflang={English}
 }
\begin{document}

\maketitle
This vignette describes the main functionalities of the \textbf{BuyseTest}
package. This package implements the Generalized Pairwise Comparisons
(GPC) as defined in \cite{buyse2010generalized} for complete
observations, and extended in \cite{peron2018extension} to deal with
right-censoring. When considering a single endpoint, the GPC procedure
can be summarized as follow. Denote the endpoint by \(Y\) in the
treatment group and by \(X\) in the control group. Given a
threshold of clinical relevance \(\tau\), the aim of GPC is to
estimate the proportion in favor of treatment \(\Prob[Y \geq X +
\tau]\) and the proportion in favor of control \(\Prob[X \geq Y +
\tau]\). Other statistics such as the net benefit \(\Prob[Y \geq X +
\tau]-\Prob[X \geq Y + \tau]\) or the win ratio \(\frac{\Prob[Y \geq
X + \tau]}{\Prob[X \geq Y + \tau]}\) can then be deduced. It is
assumed that the reader is familar with the GPC terminology \footnote{if
not, \cite{buyse2010generalized} is a good place to start.},
e.g. prioritized endpoints, pair, net benefit, win ratio, threshold of
clinical relevance, \ldots, since this vignette focuses on the
software aspect of the \textbf{BuyseTest} package (not on the underlying
statistical model).

\bigskip

The \textbf{BuyseTest} package contains three main functions:
\begin{itemize}
\item the function \texttt{BuyseTest} is the main function of the package. It
performs the GPC, estimates the net benefit/win ratio, and output a
\emph{BuyseRes} object. The user can interact with \emph{BuyseRes} objects using:
\begin{itemize}
\item \texttt{summary} to obtain a nice display of the results
\item \texttt{coef} to extract the estimates.
\item \texttt{confint} to extract estimates, confidence intervals, and p.values.
\item \texttt{getIid} to extract the iid decomposition of the estimator.
\item \texttt{getPairScore} to extract the contribution of each pair to the net benefit/win ratio.
\item \texttt{getSurvival} to extract the estimates of the survival (only relevant for right-censored endpoints).
\end{itemize}
\item the \texttt{powerBuyseTest} function performs simulation studies,
e.g. to estimate the statistical power or assess the bias / type 1
error rate of a test for a specific design.
\item the \texttt{BuyseTest.options} function enables the user to display the
default values used in the \textbf{BuyseTest} package (essentially used by
the \texttt{BuyseTest} function). function. The function can also change
the default values to better match the user needs.
\end{itemize}

\clearpage

Before going further we need to load the \textbf{BuyseTest} package in the R
session:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(BuyseTest)
library(data.table)
\end{lstlisting}

To illustrate the functionalities of the package, we will used the
\texttt{veteran} dataset from the \textbf{survival} package:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
data(veteran,package="survival")
head(veteran)
\end{lstlisting}

\begin{verbatim}
  trt celltype time status karno diagtime age prior
1   1 squamous   72      1    60        7  69     0
2   1 squamous  411      1    70        5  64    10
3   1 squamous  228      1    60        3  38     0
4   1 squamous  126      1    60        9  63    10
5   1 squamous  118      1    70       11  65    10
6   1 squamous   10      1    20        5  49     0
\end{verbatim}

See \texttt{?veteran} for a presentation of the database.

\bigskip

\uline{Note:} the \textbf{BuyseTest} package is under active development. Newer
package versions may include additional functionalities and fix
previous bugs. The version of the package that is being is:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
utils::packageVersion("BuyseTest")
\end{lstlisting}

\begin{verbatim}
[1] '2.1.5'
\end{verbatim}

For completness, the details of the R session used to generate this
document are:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
sessionInfo()
\end{lstlisting}

\begin{verbatim}
R version 3.5.1 (2018-07-02)
Platform: x86_64-w64-mingw32/x64 (64-bit)
Running under: Windows 7 x64 (build 7601) Service Pack 1

Matrix products: default

locale:
[1] LC_COLLATE=Danish_Denmark.1252  LC_CTYPE=Danish_Denmark.1252   
[3] LC_MONETARY=Danish_Denmark.1252 LC_NUMERIC=C                   
[5] LC_TIME=Danish_Denmark.1252    

attached base packages:
[1] tools     stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] BuyseTest_2.1.5   spelling_1.2      butils.base_1.2   Rcpp_1.0.4.6      data.table_1.12.8
[6] usethis_1.4.0     devtools_2.0.1    roxygen2_7.1.0   

loaded via a namespace (and not attached):
 [1] compiler_3.5.1            iterators_1.0.12          prettyunits_1.0.2        
 [4] base64enc_0.1-3           remotes_2.0.2             testthat_2.0.0           
 [7] digest_0.6.17             pkgbuild_1.0.2            pkgload_1.0.2            
[10] lattice_0.20-35           memoise_1.1.0             rlang_0.3.1              
[13] Matrix_1.2-14             foreach_1.5.0             cli_1.0.1                
[16] parallel_3.5.1            prodlim_2019.11.13        RcppArmadillo_0.9.850.1.0
[19] withr_2.1.2               stringr_1.3.1             xml2_1.2.0               
[22] knitr_1.20                desc_1.2.0                fs_1.2.6                 
[25] stats4_3.5.1              grid_3.5.1                rprojroot_1.3-2          
[28] glue_1.3.0                R6_2.3.0                  processx_3.2.0           
[31] survival_2.44-1.1         sessioninfo_1.1.1         lava_1.6.7               
[34] callr_3.0.0               purrr_0.3.4               magrittr_1.5             
[37] splines_3.5.1             codetools_0.2-15          backports_1.1.5          
[40] ps_1.1.0                  assertthat_0.2.1          stringi_1.2.4            
[43] doParallel_1.0.15         crayon_1.3.4
\end{verbatim}

\clearpage
