inst/doc-software/overview.org
* Performing generalized pairwise comparisons (GPC) using the =BuyseTest= function

To perform generalized pairwise comparisons, the =BuyseTest= function needs:
- where the data are stored \hfill - argument =data=
- the name of the endpoints \hfill - argument =endpoint=
- the type of each endpoint \hfill - argument =type=
- the variable defining the two treatment groups \hfill - argument
  =treatment=
The =BuyseTest= function has many optional arguments to specify for example:
- the threshold of clinical relevance associated to each endpoint \hfill - argument =threshold=
- the censoring associated to each endpoint (for time to event endpoints) \hfill - argument =status=

\bigskip

There are two equivalent ways to define the GPC: 
- using a separate argument for each element[fn::the argument
  =method.inference= is set to "none" to diseable the computation of
  p-values and confidence intervals. This makes the execution of
  =BuyseTest= much faster.]:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT <- BuyseTest(data = veteran, 
                endpoint = "time", 
                type = "timeToEvent", 
                treatment = "trt", 
                status = "status", 
                threshold = 20)
#+END_SRC

#+RESULTS:
#+begin_example

         Generalized Pairwise Comparisons

Settings 
   - 2 groups  : Control = 1 and Treatment = 2
   - 1 endpoint: 
       priority endpoint type           operator             threshold event       
       1        time     time to event  higher is favorable  20        status (0 1)
   - right-censored pairs: probabilistic score based on the survival curves 

Point estimation and calculation of the iid decomposition

Estimation of the estimator's distribution 
   - method: moments of the U-statistic

Gather the results in a S4BuyseTest object
#+end_example

\clearpage

- or via a formula interface. In the formula interface endpoint are
  wrapped by parentheses. The parentheses must be preceded by their
  type: 
    #+ATTR_LATEX: :environment itemize :options [label={-}]
    + binary (=b=, =bin=, or =binary=)
    + continuous (=c=, =cont=, or  =continuous=)
    + time to event (=t=, =tte=, or =timetoevent=)

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT.f <- BuyseTest(trt ~ tte(time, threshold = 20, status = "status"),
                  data = veteran, trace = 0)
#+END_SRC

#+RESULTS:

Here we set in addition the argument =trace= to 0 to force the
function to be silent (i.e. no display in the terminal). We can check
that the two approaches are equivalent:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
testthat::expect_equal(BT.f,BT)
#+END_SRC

#+RESULTS:

** Displaying the results

The results of the GPC can be displayed using the =summary= method:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT)
#+END_SRC 

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > results
 endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
     time        20      100        37.78          46.54      15.68        0 -0.0877 -0.0877
 CI [2.5% ; 97.5%] p.value 
  [-0.2735;0.1045] 0.37162
#+end_example

\clearpage

 To display the number of pairs instead of the percentage of pairs
that are favorable/unfavorable/neutral/uniformative, set the argument
=percentage= to =FALSE=:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT, percentage = FALSE)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > results
 endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
     time        20  4692   1772.59     2183.89  735.52     0 -0.0877 -0.0877
 CI [2.5% ; 97.5%] p.value 
  [-0.2735;0.1045] 0.37162
#+end_example

\bigskip

By default =summary= displays results relative to the net benefit. To
get results for the win ratio set the argument =statistic= to
"winRatio":
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT, statistic = "winRatio")
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : win ratio (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 1 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > results
 endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  delta  Delta
     time        20      100        37.78          46.54      15.68        0 0.8117 0.8117
 CI [2.5% ; 97.5%] p.value 
   [0.5134;1.2833] 0.37195
#+end_example

See =help(BuyseRes-summary)= for more detailed explanations about the
=summary= method and its output.

\clearpage

