inst/doc-software/overview.tex

\section{Performing generalized pairwise comparisons (GPC) using the \texttt{BuyseTest} function}
\label{sec:orge885ae8}

To perform generalized pairwise comparisons, the \texttt{BuyseTest} function needs:
\begin{itemize}
\item where the data are stored \hfill - argument \texttt{data}
\item the name of the endpoints \hfill - argument \texttt{endpoint}
\item the type of each endpoint \hfill - argument \texttt{type}
\item the variable defining the two treatment groups \hfill - argument
\texttt{treatment}
\end{itemize}
The \texttt{BuyseTest} function has many optional arguments to specify for example:
\begin{itemize}
\item the threshold of clinical relevance associated to each endpoint \hfill - argument \texttt{threshold}
\item the censoring associated to each endpoint (for time to event endpoints) \hfill - argument \texttt{status}
\end{itemize}

\bigskip

There are two equivalent ways to define the GPC: 
\begin{itemize}
\item using a separate argument for each element\footnote{the argument
\texttt{method.inference} is set to "none" to diseable the computation of
p-values and confidence intervals. This makes the execution of
\texttt{BuyseTest} much faster.}:
\end{itemize}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BT <- BuyseTest(data = veteran, 
				endpoint = "time", 
				type = "timeToEvent", 
				treatment = "trt", 
				status = "status", 
				threshold = 20)
\end{lstlisting}

\begin{verbatim}
         Generalized Pairwise Comparisons

Settings 
   - 2 groups  : Control = 1 and Treatment = 2
   - 1 endpoint: 
       priority endpoint type           operator             threshold event       
       1        time     time to event  higher is favorable  20        status (0 1)
   - right-censored pairs: probabilistic score based on the survival curves 

Point estimation and calculation of the iid decomposition

Estimation of the estimator's distribution 
   - method: moments of the U-statistic

Gather the results in a S4BuyseTest object
\end{verbatim}

\clearpage

\begin{itemize}
\item or via a formula interface. In the formula interface endpoint are
wrapped by parentheses. The parentheses must be preceded by their
type: 
\begin{itemize}[label={-}]
\item binary (\texttt{b}, \texttt{bin}, or \texttt{binary})
\item continuous (\texttt{c}, \texttt{cont}, or  \texttt{continuous})
\item time to event (\texttt{t}, \texttt{tte}, or \texttt{timetoevent})
\end{itemize}
\end{itemize}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BT.f <- BuyseTest(trt ~ tte(time, threshold = 20, status = "status"),
				  data = veteran, trace = 0)
\end{lstlisting}

Here we set in addition the argument \texttt{trace} to 0 to force the
function to be silent (i.e. no display in the terminal). We can check
that the two approaches are equivalent:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
testthat::expect_equal(BT.f,BT)
\end{lstlisting}

\subsection{Displaying the results}
\label{sec:org882cc03}

The results of the GPC can be displayed using the \texttt{summary} method:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
summary(BT)
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : net benefit (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> confidence level: 0.95 
> inference       : H-projection of order 1
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
    time        20      100        37.78          46.54      15.68        0 -0.0877 -0.0877
CI [2.5% ; 97.5%] p.value 
 [-0.2735;0.1045] 0.37162
\end{verbatim}

\clearpage

 To display the number of pairs instead of the percentage of pairs
that are favorable/unfavorable/neutral/uniformative, set the argument
\texttt{percentage} to \texttt{FALSE}:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
summary(BT, percentage = FALSE)
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : net benefit (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> confidence level: 0.95 
> inference       : H-projection of order 1
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
    time        20  4692   1772.59     2183.89  735.52     0 -0.0877 -0.0877
CI [2.5% ; 97.5%] p.value 
 [-0.2735;0.1045] 0.37162
\end{verbatim}

\bigskip

By default \texttt{summary} displays results relative to the net benefit. To
get results for the win ratio set the argument \texttt{statistic} to
"winRatio":
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
summary(BT, statistic = "winRatio")
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : win ratio (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 1 
> confidence level: 0.95 
> inference       : H-projection of order 1
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  delta  Delta
    time        20      100        37.78          46.54      15.68        0 0.8117 0.8117
CI [2.5% ; 97.5%] p.value 
  [0.5134;1.2833] 0.37195
\end{verbatim}

See \texttt{help(BuyseRes-summary)} for more detailed explanations about the
\texttt{summary} method and its output.

\clearpage
