inst/doc-software/overview.org
** Using multiple endpoints
More than one endpoint can be considered by indicating a vector of
endpoints, types, and thresholds. In the formula interface, the
different endpoints must be separated with a "+" on the right hand
side of the formula:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ff2 <- trt ~ tte(time, threshold = 20, status = "status") + cont(karno, threshold = 0)
BT.H <- BuyseTest(ff2, data = veteran, trace = 0)
summary(BT.H)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 prioritized endpoints

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > neutral pairs   : re-analyzed using lower priority endpoints
 > results
 endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
     time        20   100.00        37.78          46.54      15.68        0 -0.0877 -0.0877
    karno     1e-12    15.68         5.78           7.11       2.78        0 -0.0133 -0.1009
 CI [2.5% ; 97.5%] p.value 
  [-0.2735;0.1045] 0.37162 
  [-0.2901;0.0959] 0.31478
#+end_example

The hierarchy of the endpoint is defined from left (most important
endpoint, here =time=) to right (least important endpoint, here
=karno=). It is also possible to perform the comparisons on all
endpoints setting the argument =hierarchical= to =FALSE=:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT.nH <- BuyseTest(ff2, hierarchical = FALSE, data = veteran, trace = 0)
summary(BT.nH)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 endpoints

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > neutral pairs   : re-analyzed using lower priority endpoints
 > results
 endpoint threshold weight total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta
     time        20      1      100        37.78          46.54      15.68        0 -0.0877
    karno     1e-12      1      100        41.82          44.95      13.24        0 -0.0313
   Delta CI [2.5% ; 97.5%] p.value 
 -0.0877  [-0.2735;0.1045] 0.37162 
 -0.1190  [-0.4346;0.2226] 0.49821
#+end_example

In that case the score of a pair is the weighted sum of the score
relative to each endpoint. By default the weights are all set to 1 but
this behavior can be changed by setting the argument =weight= when
calling =BuyseTest=, e.g.:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ff2w <- trt ~ tte(time, threshold = 20, status = "status", weight = 0.8)
ff2w <- update.formula(ff2w, . ~ . + cont(karno, threshold = 0, weight = 0.2))
BT.nHw <- BuyseTest(ff2w, hierarchical = FALSE, data = veteran, trace = 0)
summary(BT.nHw)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 endpoints

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > confidence level: 0.95 
 > inference       : H-projection of order 1
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > neutral pairs   : re-analyzed using lower priority endpoints
 > results
 endpoint threshold weight total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta
     time        20    0.8      100        37.78          46.54      15.68        0 -0.0877
    karno     1e-12    0.2      100        41.82          44.95      13.24        0 -0.0313
   Delta CI [2.5% ; 97.5%] p.value 
 -0.0701  [-0.2204;0.0834] 0.37073 
 -0.0764  [-0.2504;0.1024] 0.40269
#+end_example
This has been refered as the O’Brien test in the litterature
(cite:verbeeck2019generalized, section 3.2).

\clearpage

** What if smaller is better?
By default =BuyseTest= will always assume that higher values of an
endpoint are favorable. This behavior can be changed by specifying =operator = "<0"=
for an endpoint:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ffop <- trt ~ tte(time, status = "status", threshold = 20, operator = "<0")
BTinv <- BuyseTest(ffop, data = veteran, 
                   method.inference = "none", trace = 0)
BTinv
#+END_SRC

#+RESULTS:
:  endpoint threshold  delta  Delta
:      time        20 0.0844 0.0844

Internally =BuyseTest= will multiply by -1 the values of the endpoint
to ensure that lower values are considered as favorable. A direct
consequence is that =BuyseTest= will not accept an endpoint with
different operators:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ffop2 <- update(ffop, . ~ . + tte(time, "status", 10, ">0"))
try(BuyseTest(ffop2, data = veteran, 
              method.inference = "none", trace = 0))
#+END_SRC

#+RESULTS:
: Error in (function (name.call, status, correction.uninf, cpus, data, endpoint,  : 
:   Cannot have different operator for the same endpoint used at different priorities.

