inst/doc-software/overview.org
** Stratified GPC

GPC can be performed for subgroups of a categorical variable \hfill -
argument =strata=

\bigskip

 For instance, the celltype may have huge influence on the survival
time and the investigator would like to only compare patients that
have the same celltype. In the formula interface this is achieved by
adding a single variable in the right hand side of the formula:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ff2strata <- update(ff2, . ~ . + celltype)
BT2 <- BuyseTest(ff2strata, data = veteran, 
                 trace = 0, method.inference = "none")
#+END_SRC

#+RESULTS:

The fact the it is not wrapped by =bin=, =cont= or =tte= indicates
differentiate it from endpoint variables. 

\clearpage

When doing a stratified analysis, the summary method displays the
global results as well as the results within each strata[fn::the
strata-specific results can be removed by setting the argument
=strata= to ="global"= when calling =summary=.]:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT2, type.display = c("endpoint","threshold","strata",
                              "total","favorable","unfavorable","delta","Delta"))
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 prioritized endpoints and 4 strata

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: 1 (control) vs. 2 (treatment) 
 > right-censored pairs: probabilistic score based on the survival curves
 > neutral pairs   : re-analyzed using lower priority endpoints
 > uninformative pairs: no contribution at the current endpoint, analyzed at later endpoints
 > results
 endpoint threshold    strata total(%) favorable(%) unfavorable(%)   delta   Delta
     time        20    global   100.00        36.06          45.77 -0.0971 -0.0971
                     squamous    25.38        14.33           8.77  0.2193        
                    smallcell    45.69        12.69          20.88 -0.1792        
                        adeno    13.71         4.74           6.15 -0.1034        
                        large    15.23         4.30           9.97 -0.3722        
    karno     1e-12    global    18.17         6.72           8.07 -0.0135 -0.1106
                     squamous     2.28         0.76           0.94 -0.0071        
                    smallcell    12.12         4.33           5.75 -0.0311        
                        adeno     2.81         1.46           0.85  0.0448        
                        large     0.96         0.17           0.54 -0.0241
#+end_example

Note that here the numbers in the total/favorable/unfavorable/ columns
are relative to the overall sample while the delta is only relative to
the strata. The global delta is a sum of the strata specific delta
weighted by the empirical proportion of pairs for each strata.

** Stopping comparison for neutral pairs
In presence of neutral pairs, =BuyseTest= will, by default, continue
the comparison on the endpoints with lower priority. For instance let
consider a dataset with one observation in each treatment arm:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.sim <- data.table(Id = 1:2,
                     treatment = c("Yes","No"),
                     tumor = c("Yes","Yes"),
                     size = c(15,20))
dt.sim
#+END_SRC

#+RESULTS:
:    Id treatment tumor size
: 1:  1       Yes   Yes   15
: 2:  2        No   Yes   20

\clearpage

If we use the GPC with tumor as the first endpoint and size as the
second endpoint:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT.pair <- BuyseTest(treatment ~ bin(tumor) + cont(size, operator = "<0"), data = dt.sim,
                     trace = 0, method.inference = "none")
summary(BT.pair)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 prioritized endpoints

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: No (control) vs. Yes (treatment) 
 > neutral pairs   : re-analyzed using lower priority endpoints
 > results
 endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%) delta Delta
    tumor       0.5      100            0              0        100        0     0     0
     size     1e-12      100          100              0          0        0     1     1
#+end_example

the outcome of the comparison is neutral for the first priority, but
favorable for the second priority. If we set the argument
=neutral.as.uninf= to =FALSE=, =BuyseTest= will stop the comparison
when a pair is classified as neutral:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT.pair2 <- BuyseTest(treatment ~ bin(tumor) + cont(size, operator = "<0"), data = dt.sim,
                     trace = 0, method.inference = "none", neutral.as.uninf = FALSE)
summary(BT.pair2)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 2 prioritized endpoints

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: No (control) vs. Yes (treatment) 
 > neutral pairs   : ignored at lower priority endpoints
 > results
 endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%) delta Delta
    tumor       0.5      100            0              0        100        0     0     0
     size     1e-12        0            0              0          0        0     0     0
#+end_example

So in this case no pair is analyzed at second priority.

\clearpage

