inst/doc-software/overview.tex

\subsection{What about p-value and confidence intervals?}
\label{sec:org895d63a}

Several methods are available in \texttt{BuyseTest} to perform statistical inference:
\begin{itemize}
\item \textbf{permutation test} setting the argument \texttt{method.inference} to
\texttt{"permutation"}. Assuming exchangeability under the null hypothesis,
this approach gives valid p-values (regardless to the sample size)
for testing the absence of a difference between the groups.
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BT.perm <- BuyseTest(trt ~ tte(time, threshold = 20, status = "status"),
					 data = veteran, trace = 0, method.inference = "permutation",
					 seed = 10) 
summary(BT.perm)
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : net benefit (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> confidence level: 0.95 
> inference       : permutation test with 1000 samples 
                    p-value computed using the permutation distribution 
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
    time        20      100        37.78          46.54      15.68        0 -0.0877 -0.0877
p.value 
  0.355
\end{verbatim}

\begin{itemize}
\item \textbf{bootstrap resampling} setting the argument \texttt{method.inference} to
\texttt{"bootstrap"}. In large enough samples, this approach gives valid
p-values and confidence intervals.
\end{itemize}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BT.boot <- BuyseTest(trt ~ tte(time, threshold = 20, status = "status"),
					 data = veteran, trace = 0, method.inference = "bootstrap",
					 seed = 10) 
summary(BT.boot)
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : net benefit (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> confidence level: 0.95 
> inference       : bootstrap resampling with 1000 samples 
                    CI computed using the percentile method; p-value by test inversion 
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
    time        20      100        37.78          46.54      15.68        0 -0.0877 -0.0877
CI [2.5% ; 97.5%] p.value 
 [-0.2922;0.1013]   0.393
\end{verbatim}

\begin{itemize}
\item \textbf{asymptotic distribution} setting the argument \texttt{method.inference} to
\texttt{"u-statistic"}. In large enough samples, this approach gives valid
p-values and confidence intervals.
\end{itemize}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BT.ustat <- BuyseTest(trt ~ tte(time, threshold = 20, status = "status"),
					  data = veteran, trace = 0, method.inference = "u-statistic") 
summary(BT.ustat)
\end{lstlisting}

\begin{verbatim}
      Generalized pairwise comparisons with 1 endpoint

> statistic       : net benefit (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> confidence level: 0.95 
> inference       : H-projection of order 1
> treatment groups: 1 (control) vs. 2 (treatment) 
> right-censored pairs: probabilistic score based on the survival curves
> results
endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
    time        20      100        37.78          46.54      15.68        0 -0.0877 -0.0877
CI [2.5% ; 97.5%] p.value 
 [-0.2735;0.1045] 0.37162
\end{verbatim}

The first two approaches require simulating a large number of samples
and applying the GPC to each of these samples. The number of samples
is set using the arugment \texttt{n.resampling} and it should large enough to
limit the Monte Carlo error when estimating the p-value. Typically
should be at least 10000 to get, roughtly, 2-digit precision, as
examplified below:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
set.seed(10)
sapply(1:10, function(i){mean(rbinom(1e4, size = 1, prob = 0.05))})
\end{lstlisting}

\begin{verbatim}
[1] 0.0511 0.0491 0.0489 0.0454 0.0516 0.0522 0.0468 0.0483 0.0491 0.0508
\end{verbatim}
Indeed, here we get a reasonnable approximation of \texttt{0.05} (if we round
and only keep 2 digits). Note that to get 3 digits precision we would
need more samples. The last method does not rely on resampling but on
the computation of the influence function of the
estimator. Fortunately, when using the Gehan's scoring rule, this does
not really involve any extra-calculations and this is therefore very
fast to perform. When using the Peron's scoring rule, more serious
extra-calculations are involved so the computation time is expected to
increase by a factor 5 to 10 compared to the point estimate alone
(i.e. \texttt{method.inference} equal to \texttt{"none"}).

\clearpage

\section{Getting additional inside: looking at the pair level}
\label{sec:org8b731b9}

So far we have looked at the overall score and probabilities. But it
is also possible to extract the score relative to each pair, as well
as to "manually" compute this score. This can give further inside on
what the software is actually doing and what is the contribution of
each individual on the evaluation of the treatment.
