inst/doc-software/overview.tex

\subsubsection{Computation of the score with only one censored event}
\label{sec:orgbc0d1ce}

Let's look at pair 91:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
getPairScore(BT.keep2, endpoint = 1, rm.withinStrata = FALSE)[91]
\end{lstlisting}

\begin{verbatim}
   index.1 index.2 indexWithinStrata.1 indexWithinStrata.2 favorable unfavorable   neutral
1:      22      71                  22                   2         0   0.6950827 0.3049173
   uninf weight
1:     0      1
\end{verbatim}

In the dataset this corresponds to:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
veteran[c(22,71),]
\end{lstlisting}

\begin{verbatim}
   trt  celltype time status karno diagtime age prior
22   1 smallcell   97      0    60        5  67     0
71   2  squamous  112      1    80        6  60     0
\end{verbatim}

The observation from the control group is censored at 97 while the
observation from the treatment group has an event at 112. Since the
threshold is 20, and (112-20)<97, we know that the pair is not in
favor of the treatment. The formula for probability in favor of the
control is \(\frac{S_c(97)}{S_c(112+20)}\). The survival at the event
time in the censoring group is stored in survTimeC. Since observation
22 is the 22th observation in the control group:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
iSurv <- outSurv$survTimeC[22,] 
iSurv
\end{lstlisting}

\begin{verbatim}
                     time       SurvivalC-threshold               SurvivalC_0 
               97.0000000                 0.5615232                 0.5171924 
      SurvivalC+threshold       SurvivalT-threshold               SurvivalT_0 
                0.4235463                 0.4558824                 0.3643277 
      SurvivalT+threshold index.SurvivalC-threshold         index.SurvivalC_0 
                0.2827500                25.0000000                28.0000000 
index.SurvivalC+threshold index.SurvivalT-threshold         index.SurvivalT_0 
               33.0000000                27.0000000                32.0000000 
index.SurvivalT+threshold 
               35.0000000
\end{verbatim}

Since we are interested in the survival in the control arm exactly at the event time:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
Sc97 <- iSurv["SurvivalC_0"] 
Sc97
\end{lstlisting}

\begin{verbatim}
SurvivalC_0 
  0.5171924
\end{verbatim}

The survival at the event time in the treatment group is stored in
survTimeC. Since observation 71 is the 2nd observation in the treatment
group:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
iSurv <- outSurv$survTimeT[2,] ## survival at time 112+20
iSurv
\end{lstlisting}

\begin{verbatim}
                     time       SurvivalC-threshold               SurvivalC_0 
              112.0000000                 0.5319693                 0.4549201 
      SurvivalC+threshold       SurvivalT-threshold               SurvivalT_0 
                0.3594915                 0.3801681                 0.2827500 
      SurvivalT+threshold index.SurvivalC-threshold         index.SurvivalC_0 
                0.2827500                27.0000000                32.0000000 
index.SurvivalC+threshold index.SurvivalT-threshold         index.SurvivalT_0 
               37.0000000                31.0000000                35.0000000 
index.SurvivalT+threshold 
               35.0000000
\end{verbatim}

Since we are interested in the survival in the control arm at the event time plus threshold:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
Sc132 <- iSurv["SurvivalC+threshold"] 
Sc132
\end{lstlisting}

\begin{verbatim}
SurvivalC+threshold 
          0.3594915
\end{verbatim}

The probability in favor of the control is then:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
Sc132/Sc97
\end{lstlisting}

\begin{verbatim}
SurvivalC+threshold 
          0.6950827
\end{verbatim}

\subsubsection{Computation of the score with two censored events}
\label{sec:orgd158cc2}

When both observations are censored, the formula for computing the
probability in favor of treatment or control involves an
integral. This integral can be computed using the function
\texttt{calcIntegralSurv\textbackslash{}\_cpp} that takes as argument a matrix containing the
survival and the jumps in survival, e.g.:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
head(outSurv$survJumpT)
\end{lstlisting}

\begin{verbatim}
     time  survival   dSurvival index.survival index.dSurvival1 index.dSurvival2
[1,]    1 0.7681159 -0.02941176             12                0                1
[2,]    2 0.7536232 -0.01470588             13                1                2
[3,]    7 0.7388463 -0.02941176             14                2                3
[4,]    8 0.7388463 -0.02941176             14                3                4
[5,]   13 0.7092924 -0.01470588             16                4                5
[6,]   15 0.6945155 -0.02941176             17                5                6
\end{verbatim}

and the starting time of the integration time. For instance, let's
look at pair 148:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
getPairScore(BT.keep2, endpoint = 1, rm.withinStrata = FALSE)[148]
\end{lstlisting}

\begin{verbatim}
   index.1 index.2 indexWithinStrata.1 indexWithinStrata.2 favorable unfavorable   neutral
1:      10      72                  10                   3 0.5058685   0.3770426 0.1170889
   uninf weight
1:     0      1
\end{verbatim}

which corresponds to the observations:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
veteran[c(10,72),]
\end{lstlisting}

\begin{verbatim}
   trt celltype time status karno diagtime age prior
10   1 squamous  100      0    70        6  70     0
72   2 squamous   87      0    80        3  48     0
\end{verbatim}

The probability in favor of the treatment (\(p_F\)) and control (\(p_{UF}\)) can be computed
as:
\begin{align*}
p_F &= -\frac{1}{S_T(x)S_C(y)}\int_{t>y} S_T(t+\tau) dS_C(t) \\
p_{UF} &= -\frac{1}{S_T(x)S_C(y)}\int_{t>x} S_C(t+\tau) dS_T(t)
\end{align*}
where \(x=87\) and \(y=100\). To ease the call of \texttt{calcIntegralScore\_cpp} we create a warper:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
calcInt <- function(...){ ## here we don't need to return the functionnal derivative of the score 
	BuyseTest:::.calcIntegralSurv_cpp(..., 
									  returnDeriv = FALSE, 
									  derivSurv = matrix(0), 
									  derivSurvD = matrix(0))
}
\end{lstlisting}

and then call it to compute the probabilities:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
denom <- as.double(outSurv$survTimeT[3,"SurvivalT_0"] * outSurv$survTimeC[10,"SurvivalC_0"])
M <- cbind("favorable" = -calcInt(outSurv$survJumpC, start = 100, 
								  lastSurv = outSurv$lastSurv[2],
								  lastdSurv = outSurv$lastSurv[1])/denom,
		   "unfavorable" = -calcInt(outSurv$survJumpT, start = 87, 
									lastSurv = outSurv$lastSurv[1],
									lastdSurv = outSurv$lastSurv[2])/denom)
rownames(M) <- c("lowerBound","upperBound")
M
\end{lstlisting}

\begin{verbatim}
           favorable unfavorable
lowerBound 0.5058685   0.3770426
upperBound 0.5058685   0.3770426
\end{verbatim}

\clearpage
