inst/doc-software/overview.org
* Dealing with missing values or/and right censoring 

In presence of censoring or missing values, some pairs may be
classified as uninformative. This may bias the estimate of the net net
benefit. Two corrections are currently proposed to correct this bias.

\bigskip

To illustrate the effect of these correction, we will use the
following dataset:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(10)
dt <- simBuyseTest(5e2, latent = TRUE, argsCont = NULL,
                   argsTTE = list(scale.T = 1/2, scale.C = 1,
                                  scale.Censoring.C = 1, scale.Censoring.T = 1))
dt[, status1 := 1]
head(dt)
#+END_SRC

#+RESULTS:
#+begin_example
   treatment eventtimeUncensored eventtimeCensoring eventtime status toxicity eta_toxicity
1:         C           1.3499793          0.4546612 0.4546612      0      yes  -0.30786498
2:         C           1.3022440          0.8234702 0.8234702      0       no   0.75808558
3:         C           0.9800451          0.3656312 0.3656312      0      yes  -0.57386341
4:         C           0.1809881          0.6066301 0.1809881      1      yes  -0.93874446
5:         C           0.2747980          0.5944344 0.2747980      1      yes  -0.02769932
6:         C           0.1351895          0.7215782 0.1351895      1      yes  -1.06624865
   status1
1:       1
2:       1
3:       1
4:       1
5:       1
6:       1
#+end_example

where we have the uncensored event times as well as the censored event
times. The percentage of censored observations is:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
100*dt[,mean(status==0)]
#+END_SRC

#+RESULTS:
: [1] 46

We would like to be able to recover the net benefit estimated with the uncensored event times:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest(treatment ~ tte(eventtimeUncensored, status1, threshold = 0.5),
          data = dt,
          scoring.rule = "Gehan", method.inference = "none", trace = 0)
#+END_SRC

#+RESULTS:
:             endpoint threshold   delta   Delta
:  eventtimeUncensored       0.5 -0.2314 -0.2314

using the censored survival times:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest(treatment ~ tte(eventtime, status, threshold = 0.5),
          data = dt,
          scoring.rule = "Gehan", method.inference = "none", trace = 0)
#+END_SRC

#+RESULTS:
:   endpoint threshold   delta   Delta
:  eventtime       0.5 -0.0881 -0.0881

As we can see on this example, the net benefit is shrunk toward 0.

*** Inverse probability-of-censoring weights (IPCW)

With IPCW the weights of the non-informative pairs is redistributed to
the informative pairs. This is only a good strategy when there are no
neutral pairs or there are no lower priority endpoints. This gives an
estimate much closer to the true net benefit:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT <- BuyseTest(treatment ~ tte(eventtime, status, threshold = 0.5),
                data = dt, keep.pairScore = TRUE, trace = 0,
                scoring.rule = "Gehan", method.inference = "none", correction.uninf = 2)
summary(BT)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: C (control) vs. T (treatment) 
 > right-censored pairs: deterministic score or uninformative
 > uninformative pairs: no contribution, their weight is passed to the informative pairs using IPCW
 > results
  endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
 eventtime       0.5      100        11.31          34.64      54.05        0 -0.2333 -0.2333
#+end_example


We can also see that no pair is finally classified as non
informative. To get some inside about the correction we can look at
the scores of the pairs:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
iScore <- getPairScore(BT, endpoint = 1)
#+END_SRC

#+RESULTS:

To get a synthetic view, we only look at the unique
favorable/unfavorable/neutral/uniformative results:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
iScore[,.SD[1], 
       .SDcols = c("favorableC","unfavorableC","neutralC","uninfC"),
       by = c("favorable","unfavorable","neutral","uninf")]
#+END_SRC

#+RESULTS:
:    favorable unfavorable neutral uninf favorableC unfavorableC neutralC uninfC
: 1:         0           0       0     1   0.000000     0.000000 0.000000      0
: 2:         0           1       0     0   0.000000     2.647043 0.000000      0
: 3:         0           0       1     0   0.000000     0.000000 2.647043      0
: 4:         1           0       0     0   2.647043     0.000000 0.000000      0

We can see that the favorable/unfavorable/neutral pairs have seen
their contribution multiplied by:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
iScore[,1/mean(favorable + unfavorable + neutral)]
#+END_SRC

#+RESULTS:
: [1] 2.647043

i.e. the inverse probability of being informative. 

*** Correction at the pair level

Another possible correction is to distribute the non-informative
weight of a pair to the average favorable/unfavorable/neutral
probability observed on the sample:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT <- BuyseTest(treatment ~ tte(eventtime, status, threshold = 0.5),
                data = dt, keep.pairScore = TRUE, trace = 0,
                scoring.rule = "Gehan", method.inference = "none", correction.uninf = TRUE)
summary(BT)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: C (control) vs. T (treatment) 
 > right-censored pairs: deterministic score or uninformative
 > uninformative pairs: score equals the averaged score of all informative pairs
 > results
  endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   delta   Delta
 eventtime       0.5      100        11.31          34.64      54.05        0 -0.2333 -0.2333
#+end_example


Looking at the scores of the pairs:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
iScore <- getPairScore(BT, endpoint = 1)
iScore[,.SD[1], 
       .SDcols = c("favorableC","unfavorableC","neutralC","uninfC"),
       by = c("favorable","unfavorable","neutral","uninf")]
#+END_SRC

#+RESULTS:
:    favorable unfavorable neutral uninf favorableC unfavorableC  neutralC uninfC
: 1:         0           0       0     1  0.1131029    0.3464344 0.5404627      0
: 2:         0           1       0     0  0.0000000    1.0000000 0.0000000      0
: 3:         0           0       1     0  0.0000000    0.0000000 1.0000000      0
: 4:         1           0       0     0  1.0000000    0.0000000 0.0000000      0

we can see that the corrected probability have not changed for the
informative pairs, but for the non-informative they have been set to:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
iScore[, .(favorable = weighted.mean(favorable, w = 1-uninf), 
           unfavorable = weighted.mean(unfavorable, w = 1-uninf), 
           neutral = weighted.mean(neutral, w = 1-uninf))]
#+END_SRC

#+RESULTS:
:    favorable unfavorable   neutral
: 1: 0.1131029   0.3464344 0.5404627

\clearpage

