inst/doc-software/overview.org
* Simulating data using =simBuyseTest=
You can simulate data with the =simBuyseTest= function. For instance
the following code simulates data for 5 individuals in the treatment
arm and 5 individuals in the control arm:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(10)
simBuyseTest(n.T = 5, n.C = 5)
#+END_SRC

#+RESULTS:
#+begin_example
    treatment  eventtime status toxicity       score
 1:         C 0.60539304      0      yes -1.85374045
 2:         C 0.31328027      1      yes -0.07794607
 3:         C 0.03946623      0      yes  0.96856634
 4:         C 0.32147489      1      yes  0.18492596
 5:         C 1.57044952      0      yes -1.37994358
 6:         T 0.29069131      0       no  1.10177950
 7:         T 0.19522131      0      yes  0.75578151
 8:         T 0.04640668      0      yes -0.23823356
 9:         T 0.05277335      1      yes  0.98744470
10:         T 0.43062009      1      yes  0.74139013
#+end_example

By default a categorical, continuous and time to event outcome are
generated independently. You can modify their distribution via the
arguments =argsBin=, =argsCont=, =argsTTE=. For instance the following
code simulates two continuous variables with mean 5 in the treatment
arm and 10 in the control arm all with variance 1:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(10)
argsCont <- list(mu.T = c(5,5), mu.C = c(10,10), 
                 sigma.T = c(1,1), sigma.C = c(1,1),
                 name = c("tumorSize","score"))
dt <- simBuyseTest(n.T = 5, n.C = 5,
                   argsCont = argsCont)
dt
#+END_SRC

#+RESULTS:
#+begin_example
    treatment eventtime status toxicity tumorSize     score
 1:         C 0.1805891      0      yes 11.086551  8.564486
 2:         C 0.1702538      1      yes  9.237455 10.362087
 3:         C 0.2621793      1       no  9.171337  8.240913
 4:         C 0.2959301      0       no 10.834474  9.675456
 5:         C 0.4816549      1      yes  9.032348  9.348437
 6:         T 0.6446131      1       no  5.089347  6.101780
 7:         T 0.7372264      1      yes  4.045056  5.755782
 8:         T 0.7213402      0      yes  4.804850  4.761766
 9:         T 0.1580651      1      yes  5.925521  5.987445
10:         T 0.2212117      0      yes  5.482979  5.741390
#+end_example

This functionality is based on the =sim= function of the *lava*
package (https://github.com/kkholst/lava)

\clearpage

* Power calculation using =powerBuyseTest=

The function =powerBuyseTest= can be used to perform power
calculation, i.e., estimate the probability of rejecting a null
hypothesis under a specific generative mechanism. The user therefore
need to specify:
- the generative mechanism via a function \hfill - argument =sim=
- the null hypothesis \hfill - argument =null=
- the sample size(s) for the which the power should be computed  \hfill - argument =sample.size=

\bigskip

Consider the following generative mechanism where the outcome follows
a Student's t-distribution in the treatment and control group, with same
variance and degrees of freedom but different mean:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
simFCT <- function(n.C, n.T){
     out <- rbind(cbind(Y=stats::rt(n.C, df = 5), group=0),
                  cbind(Y=stats::rt(n.T, df = 5) + 1/2, group=1))
     return(data.table::as.data.table(out))
}
simFCT(101,101)
#+END_SRC

#+RESULTS:
#+begin_example
              Y group
  1:  0.9243314     0
  2: -1.9571691     0
  3:  4.7270966     0
  4:  1.5312298     0
  5:  0.1236634     0
 ---                 
198:  0.6567732     1
199: -0.5096230     1
200:  0.5129740     1
201:  0.9709603     1
202:  0.1356299     1
#+end_example

We then define the null hypothesis:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
null <- c("netBenefit" = 0)
#+END_SRC

#+RESULTS:

Naming the value is important since that will indicate which statistic
should be used (here the net benefit). We can assess the power of the
Wilcoxon's test using the following syntax:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
powerW <- powerBuyseTest(sim = simFCT, 
                         sample.size = c(5,10,20,30,50,100),
                         null = null,
                         formula = group ~ cont(Y), 
                         n.rep = 1000, seed = 10,
                         cpus = 3, trace = 0)
#+END_SRC

\clearpage

And use the summary method to display the power (column
=rejection.rate=):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(powerW)
#+END_SRC

#+RESULTS:
#+begin_example
        Simulation study with Generalized pairwise comparison
        with 1000 samples

 > statistic   : net benefit (null hypothesis Delta=0)
 endpoint threshold n.T n.C mean.estimate sd.estimate mean.se rejection.rate
        Y     1e-12   5   5        0.2517      0.3672   0.336          0.078
                     10  10        0.2535      0.2538  0.2459           0.14
                     20  20        0.2492      0.1783  0.1754          0.249
                     30  30        0.2463      0.1439  0.1436          0.357
                     50  50        0.2428       0.113  0.1113           0.56
                    100 100        0.2448      0.0799  0.0787          0.862

 n.T          : number of observations in the treatment group
 n.C          : number of observations in the control group
 mean.estimate: average estimate over simulations
 sd.estimate  : standard deviation of the estimate over simulations
 mean.se      : average estimated standard error of the estimate over simulations
 rejection    : frequency of the rejection of the null hypothesis over simulations
(standard error: H-projection of order 1| p-value: after transformation)
#+end_example

\clearpage

* Modifying default options
The =BuyseTest.options= method enable to get and set the default
options of the =BuyseTest= function. For instance, the default option
for trace is:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options("trace")
#+END_SRC

#+RESULTS:
: $trace
: [1] 2

To change the default option to 0 (i.e. no output) use:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(trace = 0)
#+END_SRC

#+RESULTS:

To change what the results output by the summary function use:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(summary.display = list(c("endpoint","threshold","delta","Delta","information(%)")))
summary(BT)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 > statistic       : net benefit (delta: endpoint specific, Delta: global) 
 > null hypothesis : Delta == 0 
 > treatment groups: C (control) vs. T (treatment) 
 > right-censored pairs: deterministic score or uninformative
 > uninformative pairs: score equals the averaged score of all informative pairs
 > results
  endpoint threshold   delta   Delta information(%)
 eventtime         1 -0.0202 -0.0202            100
#+end_example


To restore the original default options do:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(reinitialise = TRUE)
#+END_SRC

#+RESULTS:

\clearpage


* References
:PROPERTIES:
:UNNUMBERED: t
:END:

#+BEGIN_EXPORT latex
\begingroup
\renewcommand{\section}[2]{}
#+END_EXPORT

bibliographystyle:apalike
[[bibliography:bibliography.bib]]

#+BEGIN_EXPORT latex
\endgroup
#+END_EXPORT





* CONFIG :noexport:
#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+LaTeX_CLASS_OPTIONS: [12pt]
#+OPTIONS:   title:t author:t toc:nil todo:nil
#+OPTIONS:   H:3 num:t 
#+OPTIONS:   TeX:t LaTeX:t
#+PROPERTY: tangle yes

** Code
#+PROPERTY: header-args :session *R*
#+PROPERTY: header-args :tange yes % extract source code: http://orgmode.org/manual/Extracting-source-code.html
#+PROPERTY: header-args :cache no 
#+LATEX_HEADER: \RequirePackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}

